In [1]:
import boto3
import pandas as pd
import numpy as np

import os
import sagemaker

sess = sagemaker.Session()

s3 = boto3.resource('s3')
bucket_name = 'analytics-data-science-competitions'
bucket = s3.Bucket(bucket_name)

## Defining files names
file_key_1 = 'Predict-Future-Sales/items.csv'
file_key_2 = 'Predict-Future-Sales/item_categories.csv'
file_key_3 = 'Predict-Future-Sales/shops.csv'
file_key_4 = 'Predict-Future-Sales/sales_train.csv'
file_key_5 = 'Predict-Future-Sales/test.csv'

bucket_object_1 = bucket.Object(file_key_1)
file_object_1 = bucket_object_1.get()
file_content_stream_1 = file_object_1.get('Body')

bucket_object_2 = bucket.Object(file_key_2)
file_object_2 = bucket_object_2.get()
file_content_stream_2 = file_object_2.get('Body')

bucket_object_3 = bucket.Object(file_key_3)
file_object_3 = bucket_object_3.get()
file_content_stream_3 = file_object_3.get('Body')

bucket_object_4 = bucket.Object(file_key_4)
file_object_4 = bucket_object_4.get()
file_content_stream_4 = file_object_4.get('Body')

bucket_object_5 = bucket.Object(file_key_5)
file_object_5 = bucket_object_5.get()
file_content_stream_5 = file_object_5.get('Body')

## Reading data-files
items = pd.read_csv(file_content_stream_1)
items_categories = pd.read_csv(file_content_stream_2)
shops = pd.read_csv(file_content_stream_3)
sales_train = pd.read_csv(file_content_stream_4)
sales_train['date'] = pd.to_datetime(sales_train['date'], format = '%d.%m.%Y')

test = pd.read_csv(file_content_stream_5)

In [2]:
items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [3]:
items_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [4]:
shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [5]:
sales_train.head()

        date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0 2013-01-02               0       59    22154      999.00           1.0
1 2013-01-03               0       25     2552      899.00           1.0
2 2013-01-05               0       25     2552      899.00          -1.0
3 2013-01-06               0       25     2554     1709.05           1.0
4 2013-01-15               0       25     2555     1099.00           1.0

In [10]:
sales_train[(sales_train['shop_id'] == 5) & (sales_train['item_id'] == 5037)]

              date  date_block_num  shop_id  item_id  item_price  item_cnt_day
1953995 2014-09-21              20        5     5037      2599.0           1.0
2150561 2014-11-29              22        5     5037      2599.0           1.0
2288630 2014-12-28              23        5     5037      1999.0           1.0
2288631 2014-12-20              23        5     5037      1999.0           1.0
2335446 2015-01-02              24        5     5037      1999.0           1.0
2335447 2015-01-07              24        5     5037      1999.0           1.0
2618926 2015-05-29              28        5     5037      1299.0           1.0
2704068 2015-06-28              29        5     5037      1499.0           1.0
2719247 2015-07-05              30        5     5037      1499.0           1.0
2810661 2015-08-14              31        5     5037      1499.0           1.0
2810662 2015-08-20              31        5     5037       749.5           1.0
2810663 2015-08-31              31        5     5037       749.0           1.0
2860998 2015-09-05              32        5     5037       749.5           1.0

In [6]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [7]:
test['shop_id'].value_counts()

5     5100
56    5100
53    5100
52    5100
47    5100
48    5100
57    5100
58    5100
59    5100
55    5100
36    5100
4     5100
37    5100
35    5100
38    5100
34    5100
46    5100
41    5100
44    5100
39    5100
49    5100
50    5100
42    5100
19    5100
6     5100
3     5100
2     5100
7     5100
10    5100
12    5100
28    5100
31    5100
26    5100
25    5100
22    5100
24    5100
21    5100
15    5100
16    5100
18    5100
14    5100
45    5100
Name: shop_id, dtype: int64